# 11
# 449047 855428 425117 532416 358612 929816 313459 311433 472478 589139 568205
# 7
# I 1 5 400905 139831 966064 336948 119288 
# I 8 6 436704 702451 762737 557561 810021 771706
# I 3 8 389953 706628 552108 238749 661021 498160 493414 377808 
# I 13 4 237017 301569 243869 252994 
# I 3 4 408347 618608 822798 370982 
# I 8 2 424216 356268 
# I 4 10 512816 992679 693002 835918 768525 949227 628969 521945 839380 479976

# 다음 암호문 할 떄마다 암호문은 다르고 또 달라진다
# 매번 길이기 10넘어가면 볼 필요 없다 잘린다

# 문자열 
# 리스트 조작 삽입할떄 한칸씩 밀리기 -> 파이썬은 insert로 삽입, slice[x:x}로 할당하면 자동으로 밀려남
# 암호문 접근 인덱스 방식? -> idx로 제어
# for로 한 명령 단위 처리

T = 10
for test_case in range(1, T+1):
    _ = int(input())
    origin = list(input().split())
    n = int(input())
    exp = list(input().split())
    idx = 0

    for i in range(n):
        if exp[idx] == 'I':
            idx += 1
        
            pos = int(exp[idx])
            idx += 1

            num = int(exp[idx])
            idx += 1
            add = exp[idx: idx+num]
            idx += num
            origin[pos:pos] = add
            

    res = ' '.join(map(str, origin[:10]))
    print(f"#{test_case} {res}")
       
        
            

